# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [3]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [4]:
pd.read_sql("""
SELECT lastName, firstName
FROM employees
JOIN offices
    ON employees.officeCode = offices.officeCode
WHERE city = "Boston"
""", conn)

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [12]:
pd.read_sql("""
SELECT offices.officeCode, city, count(employees.employeeNumber) as Num_Employees
FROM offices
JOIN employees
    ON employees.officeCode = offices.OfficeCode
GROUP BY employees.officeCode
""", conn)

   officeCode           city  Num_Employees
0           1  San Francisco              6
1           2         Boston              2
2           3            NYC              2
3           4          Paris              5
4           5          Tokyo              2
5           6         Sydney              4
6           7         London              2

## Write 3 questions of your own and answer them

In [34]:
# Answers will vary

# Example question: 
"""
How many customers are there per office?
"""

pd.read_sql("""
SELECT officeCode, city, COUNT(customerNumber) as Customer_Count
FROM customers
JOIN employees
    ON customers.salesRepEmployeeNumber = employees.employeeNumber
GROUP BY officeCode 
""", conn)

   officeCode       city  Customer_Count
0           1  Las Vegas              12
1           2  Allentown              12
2           3        NYC              15
3           4     Nantes              29
4           5  Singapore               5
5           6  Melbourne              10
6           7    Stavern              17

In [52]:
"""
How many dollars of inventory is sitting in the "shipped" status?
"""

pd.read_sql("""
SELECT status, sum(quantityOrdered*priceEach) as Grand_Total
FROM orders
JOIN orderdetails
    USING(orderNumber)
WHERE status = "Shipped"
""", conn)

    status  Grand_Total
0  Shipped   8865094.64

In [57]:
"""
Show all of the sales reps that live in CA.
"""

pd.read_sql("""
SELECT lastName, firstName, email
FROM employees as e
JOIN offices as o
    ON e.officeCode = o.officeCode
WHERE jobTitle = "Sales Rep" AND state = "CA"
""", conn)

   lastName firstName                           email
0  Jennings    Leslie  ljennings@classicmodelcars.com
1  Thompson    Leslie  lthompson@classicmodelcars.com

In [64]:
"""
Show all of the cusomters who live in USA and have payments more than $30k.
"""

pd.read_sql("""
SELECT DISTINCT(customerName)
FROM customers as c
JOIN payments as p
    USING(customernumber)
WHERE country = "USA" and amount > 30000
""", conn)

                    customerName
0             Signal Gift Stores
1   Mini Gifts Distributors Ltd.
2              Land of Toys Inc.
3             Muscle Machine Inc
4          Diecast Classics Inc.
5           Technics Stores Inc.
6                Gift Depot Inc.
7                Vitachrome Inc.
8       Online Mini Collectables
9              Toys4GrownUps.com
10  Collectable Mini Designs Co.
11          Marta's Replicas Co.
12                 Mini Classics
13           Mini Creations Ltd.
14      Corporate Gift Ideas Co.
15       Tekni Collectables Inc.
16       Classic Gift Ideas, Inc
17  Online Diecast Creations Co.
18    Collectables For Less Inc.
19     The Sharp Gifts Warehouse
20              Super Scale Inc.
21              FunGiftIdeas.com
22   West Coast Collectables Co.
23  Motor Mint Distributors Inc.
24          Diecast Collectables

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [ ]:
# Your code here

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [ ]:
# Your code here

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!